#### Read database records into pandas dataframe and write it back 
1. pd.read_sql_table
2. pd.read_sql_query
3. df.to_sql
4. pd.read_sql(which is just a wrapper for first two methods)

In [15]:
import pandas as pd
import sqlalchemy

In [23]:
engine= sqlalchemy.create_engine("mysql+pymysql://root:@localhost:3306/application")

# Read_sql_table

In [24]:
df= pd.read_sql_table("buyers",engine)
df

   id   name  phone_number
0   1  biden           911
1   2   Bill    8712323232
2   3  Rahul           100

# Read_sql_query

In [56]:
query='''
Select buyers.name, buyers.phone_number,orders.name,orders.amount
From buyers inner join orders
on buyers.id=orders.customer_id
'''
df =pd.read_sql_query(query,engine)
df

     name  phone_number          name  amount
0  Rafeal           435  Google pixal     950
1   Maria          4545     yoqa mat       20
2   singh           107  Fossil watch     120
3  Rafeal           435  Google pixal     950
4   Maria          4545     yoqa mat       20
5   singh           107  Fossil watch     120

In [47]:
customer_list ={
    'id':[1,2,3],
    "Customer Name":["Rafeal","Maria","singh"],
    "Customer Phone":[435,4545,107]
}
new_df=pd.DataFrame(customer_list)
new_df

   id Customer Name  Customer Phone
0   1        Rafeal             435
1   2         Maria            4545
2   3         singh             107

In [48]:
new_df.rename(columns={
    'Customer Name': 'name',
    'Customer Phone': 'phone_number'
}, inplace=True)
new_df

   id    name  phone_number
0   1  Rafeal           435
1   2   Maria          4545
2   3   singh           107

# df.to_sql

In [53]:
new_df.to_sql(
    name = "buyers",
    con= engine,
    index=False,
    if_exists="append"
)

3

# pd.read_sql

In [54]:
pd.read_sql("buyers",engine)

   id    name  phone_number
0   1  Rafeal           435
1   2   Maria          4545
2   3   singh           107
3   1  Rafeal           435
4   2   Maria          4545
5   3   singh           107

In [55]:
query='''
Select buyers.name, buyers.phone_number,orders.name,orders.amount
From buyers inner join orders
on buyers.id=orders.customer_id
'''
pd.read_sql(query,engine)

     name  phone_number          name  amount
0  Rafeal           435  Google pixal     950
1   Maria          4545     yoqa mat       20
2   singh           107  Fossil watch     120
3  Rafeal           435  Google pixal     950
4   Maria          4545     yoqa mat       20
5   singh           107  Fossil watch     120